cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF32xL.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "USBCLK" -->
    <peripheral>
      <name>USBCLK</name>
      <description>USB Clock</description>
      <groupName>USBCLK</groupName>
      <baseAddress>0x40036000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UCCR" -->
        <register>
          <name>UCCR</name>
          <description>USB Clock Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UCSEL" -->
            <field>
              <name>UCSEL</name>
              <description>USB clock selection bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCEN" -->
            <field>
              <name>UCEN</name>
              <description>USB clock output enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR1" -->
        <register>
          <name>UPCR1</name>
          <description>USB-PLL Control Register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPINC" -->
            <field>
              <name>UPINC</name>
              <description>USB-PLL input clock selection bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UPLLEN" -->
            <field>
              <name>UPLLEN</name>
              <description>USB-PLL oscillation enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR2" -->
        <register>
          <name>UPCR2</name>
          <description>USB-PLL Control Register 2</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPOWT" -->
            <field>
              <name>UPOWT</name>
              <description>USB-PLL oscillation stabilization wait time setting bit</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR3" -->
        <register>
          <name>UPCR3</name>
          <description>USB-PLL Control Register 3</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLK" -->
            <field>
              <name>UPLLK</name>
              <description>Frequency division ratio (K) setting bit of the USB-PLL clock </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR4" -->
        <register>
          <name>UPCR4</name>
          <description>USB-PLL Control Register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x17</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLN" -->
            <field>
              <name>UPLLN</name>
              <description>Frequency division ratio (N) setting bit of the USB-PLL clock </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR5" -->
        <register>
          <name>UPCR5</name>
          <description>USB-PLL Control Register 5</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLM" -->
            <field>
              <name>UPLLM</name>
              <description>Frequency division ratio (M) setting bit of the USB-PLL clock</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UP_STR" -->
        <register>
          <name>UP_STR</name>
          <description>USB-PLL Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPRDY" -->
            <field>
              <name>UPRDY</name>
              <description>USB-PLL oscillation stabilization bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPINT_ENR" -->
        <register>
          <name>UPINT_ENR</name>
          <description>USB-PLL Interrupt Source Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSE" -->
            <field>
              <name>UPCSE</name>
              <description>USB-PLL oscillation stabilization wait complete interrupt enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPINT_STR" -->
        <register>
          <name>UPINT_STR</name>
          <description>USB-PLL Interrupt Source Status Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSI" -->
            <field>
              <name>UPCSI</name>
              <description>USB-PLL interrupt source status bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
